Repository: agardelein/oscopy
Catalog: po/*.po
Languages: es, fr

source: refreshing
es: redibujando
fr: Rafraîchissement

source: Pause command disabled in UI
fr: Commande Pause désactivé dans l'IHM

source: Linear
es: Lineal
fr: Linéaire

source: Add file(s)
es: Añadir archivo(s)
fr: Ajouter un(des) fichier(s)

source: New math signal
es: Nueva señal matemática
fr: Nouveau signal math

source: Execute script
es: Ejecutar script
fr: Exécuter un script

source: _File
es: _Archivo
fr: _Fichier

source: _Add file(s)...
es: _Añadir archivo(s)...
fr: _Ajouter un (des) fichier(s)...

source: _Update
es: Actuali_zar
fr: _Mettre à jour

source: _Execute script...
es: _Ejecutar script
fr: Exécuter un script...

source: _New Math Signal
es: Nueva señal _Matemática
fr: _Nouveau Signal math

source: _Run netlister and simulate...
es: E_jecutar el netlister y simular...
fr: _Lancer le netlister et simuler...

source: _Windows
es: _Ventanas
fr: _Fenêtres

source: _Quit
es: _Salir
fr: _Quitter

source: _Show terminal
fr: _Montrer le terminal

source: Freeze
es: Congelar
fr: Geler

source: Oscopy GUI
fr: IHM Oscopy

source: Executing command '%s' failed.
es: Falló la ejecución del comando '%s'.
fr: L'exécution de la commande '%s' a échoué.

source: No file specified
es: No se especificó un archivo
fr: Pas de fichier spécifié

source: File do not exist
es: El archivo no existe
fr: Le fichier n'existe pas

source: File is not a file
es: El archivo no es un archivo
fr: Le fichier n'est pas un fichier

source: Out of range figure number
es: Número de figura fuera de rango
fr: Numéro de figure hors gamme

source: File already loaded, use update to read it again
es: El archivo ya está cargado, use 'actualizar' para leerlo nuevamente
fr: Fichier déjà chargé, utiliser update pour le relire

source: What is %s
fr: Qu'est-ce %s

source: Create a new figure, set_ it as current, add the signals
fr: Créé une nouvelle figure, la sélectionne et ajoute les signaux

source: Destroy a figure
fr: Détruit une figure

source: Select the current figure and the current graph
fr: Sélection la figure courante et le graph courant

source: Define the layout of the current figure
fr: Défini la disposition de la figure sélectionnée

source: Print the list of figures
fr: Affiche la liste des figures

source: Draw and show the figures
fr: Dessine et affiche les figures

source: Read signal file
fr: Lit un fichier de signaux

source: %s already read, use update to reread it
es: %s ya ha sido leído, use 'actualizar' para releerlo
fr: %s déja lu, utiliser update pour le relire

source: Failed to read %s:
es: No se pudo leer %s:
fr: Echec de lecture %s:

source: File format not supported
es: El formato de archivo no está soportado
fr: Format de fichier non supporté

source: Write signals to file
fr: Ecrit les signaux dans un fichier

source: Write error:
es: Error al escribir:
fr: Erreur d'écriture:

source: Reread data files
fr: Relit les fichiers de données

source: %s not found in readers
es: %s no se encontró entre los lectores
fr: %s non trouvé dans les readers

source: Add a graph to the current figure
fr: Ajoute un graph à la figure courante

source: Maximum graph number reached
es: Se alcanzó el máximo número de gráficos
fr: Nombre de graph maximum atteinte

source: Delete a graph from the current figure
fr: Supprime un graph de la figure courante

source: Set the type of the current graph of the current figure
fr: Défini le type du graph courant de la figure courante

source: Available modes : lin Linear graph
fr: Modes disponibles : lin Graph linéaire

source: Set the axis scale
fr: Défini l'échelle de l'axe

source: Set the axis range of the current graph of the current figure
fr: Défini les limites des axes du graph courant de la figure courante

source: Set the unit to be displayed on graph axis
fr: Défini l'unité à afficher sur les axes du graph

source: Insert a list of signals into the current graph
fr: Insère une liste de signaux dans le graph courant

source: Delete a list of signals into from current graph
fr: Supprome une liste de signaux du graph courant

source: Do not consider signal for subsequent updates
fr: Exclus le signal des mise à jours ultérieures

source: Consider signal for subsequent updates
fr: Inclus le signal dans les mise à jour ultérieures

source: List loaded signals
fr: Liste les signaux chargés

source: Define a new signal destsig using mathematical expression
fr: Défini un nouveau signal destsig en utilisant une expression mathématique

source: Error creating signal from math expression:
fr: Erreur pour créer le signal à partir de l'expression mathématique:

source: Print text
fr: Affiche le texte

source: Wait for the user to press enter
fr: Attent que l'utilisateur presse entrée

source: execute commands from file
fr: Exécute des commandes à partir d'un fichier

source: Script error:
es: Error en el script:
fr: Erreur de script:

source: set the scaling factor of the graph (in power of ten) use 'auto' for automatic scaling factor e.g. factor -3, 6 set the scale factor at 1e-3 and 10e6
fr: défini le facteur d'échelle du graph (en puissance de dix) utiliser 'auto' pour un facteur d'échelle automatique par exemple factor -3, 6 défini les facteurs d'échelle à 1e-3 et 10e6

source: Signals
es: Señales
fr: Signaux

source: Invalid argument
es: Argumento inválido
fr: Argument invalide

source: Unrecognized argument
es: Argumento no reconocido
fr: Argument inconnu

source: Invalid cursor number
es: Número de cursor inválido
fr: Numéro de curseur invalide

source: Invalid cursor type
es: Tipo de cursor inválido
fr: Type de curseur invalide

source: Bad type
es: Tipo erróneo
fr: Type incorrect

source: Bad graph number
es: Número de gráfico erróneo
fr: Numéro de graph incorrect

source: No graph defined
es: No se definió un gráfico
fr: Pas de graph défini

source: Bad layout
es: Esquema erróneo
fr: Disposition incorrecte

source: Data %s not handled
es: El dato %s no está soportado
fr: Donnée %s non géré

source: Add graph
es: Añadir gráfico
fr: Ajouter un graph

source: Delete graph
es: Elimina el gráfico
fr: Supprime un graph

source: Layout
es: Esquema
fr: Disposition

source: Range...
es: Rango...
fr: Limites...

source: Units...
es: Unidades...
fr: Unités...

source: Scale
es: Escala
fr: Echelle

source: Insert signal
es: Inserta señal
fr: Insèrer un signal

source: Remove signal
es: Remueve señal
fr: Enlever un signal

source: No graph selected
es: No se seleccionó un gráfico
fr: Pas de graph sélectionné

source: Enter graph units
es: Ingrese las unidades del gráfico
fr: Entrer les unités du graph

source: Enter graph range
es: Ingrese el rango del gráfico
fr: Entrer les limites du graph

source: From
es: Desde
fr: De

source: To
es: Hasta
fr: À

source: Run %s:
es: Ejecutar %s:
fr: Exécuter %s:

source: Run netlister and simulate
es: Ejecutar el netlister y simular
fr: Exécuter le netlister et simuler

source: simulator
es: simulador
fr: simulateur

source: Run from directory:
es: Ejecutar desde directorio:
fr: Exécuter depuis le répertoire:

source: Choose directory
es: Elegir directorio
fr: Choisir le répertoire

source: Update readers once terminated
es: Actualizar los lectores al terminar
fr: Mettre à jour les readers une fois terminé

source: Command:
fr: Commande:

source: <b>Options</b>
es: <b>Opciones</b>

source: Expression:
es: Expresión:

source: Signal
es: Señal

source: Figure %d
es: Figura %d

source: do_destroy: Bad argument
es: do_destroy: Argumento erróneo

source: do_select: no args
es: do_select: faltan argumentos

source: do_select: bad figure or graph number
es: do_select: figura o número de gráfico erróneos

source: %s Figure %d: %s
es: %s Figura %d: %s

source: %s Graph %d : (%s) %s
es: %s Gráfico %d : (%s) %s

source: do_write: Bad arguments
es: do_write: Argumentos erróneos

source: Name
es: Nombre

source: Reader
es: Lector

source: Last updated (sec)
es: Actualizado por última vez (segs)

source: Error: Signal not recognized (%s)
es: Error: Señal no reconocida (%s)

source: unknown property %s
es: propiedad desconocida %s
